//Написать программу которая принимает число и выдает его квадрат. 

//Console.WriteLine("Введите число: ");
//int square = 0;
//int n = Convert.ToInt32(Console.ReadLine());
//square = n*n;
//Console.WriteLine("Квадрат числа = " + square);


